Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-effect_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: In the future, the second argument might get added automatically by a build-time transformation.
ja: 将来的には、ビルド時の変換で第 2 引数を自動で加えられるようになるかもしれません。

source: >Note > >If you use this optimization, make sure the array includes **all values from the component scope (such as props and state) that change over time and that are used by the effect**.
ja: > 補足 > > この最適化を利用する場合、**時間の経過とともに変化し副作用によって利用される、コンポーネントスコープの値（props や state など）**がすべて配列に含まれていることを確認してください。

source: Otherwise, your code will reference stale values from previous renders.
ja: さもないとあなたのコードは以前のレンダー時の古い値を参照してしまうことになります。

source: Learn more about [how to deal with functions](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies) and [what to do when the array changes too often](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often).
ja: その他の最適化のオプションについては[フック API リファレンス](/docs/hooks-reference.html)で説明しています。

source: > >If you want to run an effect and clean it up only once (on mount and unmount), you can pass an empty array (`[]`) as a second argument.
ja: > > もしも副作用とそのクリーンアップを 1 度だけ（マウント時とアンマウント時にのみ）実行したいという場合、空の配列 (`[]`) を第 2 引数として渡すことができます。

source: This tells React that your effect doesn't depend on *any* values from props or state, so it never needs to re-run.
ja: こうすることで、あなたの副作用は props や state の値の*いずれにも*依存していないため再実行する必要が一切ない、ということを React に伝えることができます。

source: This isn't handled as a special case -- it follows directly from how the dependencies array always works.
ja: これは特別なケースとして処理されているわけではなく、依存配列を普通に処理すればそうなるというだけの話です。

source: > >If you pass an empty array (`[]`), the props and state inside the effect will always have their initial values.
ja: > > 空の配列 (`[]`) を渡した場合、副作用内では props と state の値は常にその初期値のままになります。

source: While passing `[]` as the second argument is closer to the familiar `componentDidMount` and `componentWillUnmount` mental model, there are usually [better](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies) [solutions](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often) to avoid re-running effects too often.
ja: `[]` を渡すことはおなじみの `componentDidMount` と `componentWillUnmount` による概念と似ているように感じるでしょうが、通常は[こちら](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies)や[こちら](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often)のように、副作用を過度に再実行しないためのよりよい解決方法があります。

source: Also, don't forget that React defers running `useEffect` until after the browser has painted, so doing extra work is less of a problem.
ja: また `useEffect` はブラウザが描画し終えた後まで遅延されますので、追加の作業をしてもそれほど問題にならないということもお忘れなく。

source: > >We recommend using the [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) rule as part of our [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) package.
ja: > > [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) パッケージの [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) ルールを有効にすることをお勧めします。

source: It warns when dependencies are specified incorrectly and suggests a fix.
ja: これは依存の配列が正しく記述されていない場合に警告し、修正を提案します。

source: ## Next Steps {#next-steps}
ja: ## 次のステップ {#next-steps}

source: Congratulations!
ja: おめでとうございます！

source: This was a long page, but hopefully by the end most of your questions about effects were answered.
ja: 長いページでしたが、最終的に副作用に関するほとんどの疑問が解決していることを望みます。

source: You've learned both the State Hook and the Effect Hook, and there is a *lot* you can do with both of them combined.
ja: これでステートフックと副作用フックの両方を学んだので、それらを組み合わせてやれることが*たくさん*あります。

source: They cover most of the use cases for classes -- and where they don't, you might find the [additional Hooks](/docs/hooks-reference.html) helpful.
ja: クラスコンポーネントにおけるほとんどのユースケースがカバーされていますが、足りない部分については[他のフック](/docs/hooks-reference.html)が役立つかもしれません。

source: We're also starting to see how Hooks solve problems outlined in [Motivation](/docs/hooks-intro.html#motivation).
ja: また、[動機](/docs/hooks-intro.html#motivation)のところで述べた問題をフックがどのように解決するのかについてもわかり始めてきたでしょう。

source: We've seen how effect cleanup avoids duplication in `componentDidUpdate` and `componentWillUnmount`, brings related code closer together, and helps us avoid bugs.
ja: 副作用のクリーンアップがどのようにして `componentDidUpdate` と `componentWillUnmount` との間でのコードの重複を防ぎ、関係したコードを並べて書くことができるようにし、バグの少ないコードを記述できるようにするのかを見てきました。

source: We've also seen how we can separate effects by their purpose, which is something we couldn't do in classes at all.
ja: また目的別に副作用を分割する方法も学びましたが、これはクラスでは全く不可能なことでした。

source: At this point you might be questioning how Hooks work.
ja: この時点で、一体フックがどのように動作しているのか疑問に感じているかもしれません。

source: How can React know which `useState` call corresponds to which state variable between re-renders?
ja: `useState` のそれぞれの呼び出しがどの state 変数に対応しているのかを、React はどのようにして知るのでしょうか？

source: How does React "match up" previous and next effects on every update?
ja: 更新のたびに、前回と今回の副作用とを React はどのように対応付けるのでしょうか？

source: **On the next page we will learn about the [Rules of Hooks](/docs/hooks-rules.html) -- they're essential to making Hooks work.**
ja: **次のページでは[フックのルール](/docs/hooks-rules.html)について学びます -- このルールはフックが動作するために必須のものです。**
